{
  "news": [
    {
      "id": 1,
      "thumbnail": "./img/news/1.jpg",
      "headline": "Know everything about India's one of the most powerful and lethal explosives",
      "shortNews": "This achievement has been significantly propelled by the Ministry of Defence's push towards Atmanirbharta, or self-reliance, in the defence sector. Additionally, the Directorate General of Naval Armament Inspection of the Indian Navy has provided crucial guidance and support throughout the process.",
      "date": "2024-07-02",
      "link": "https://www.indiatvnews.com/amp/news/india/solar-industries-develops-indigenous-game-changing-explosives-for-indian-armed-forces-sebex-2-2024-07-02-939819",
      "showOnHomepage": true,
      "showOnNewspage": true
    },
    {
      "id": 2,
      "thumbnail": "./img/news/0.jpg",
      "headline": "Solar Industries at record high, touches Rs 1 lakh crore m-cap on new explosive formulation",
      "shortNews": "SEBEX 2 - has been developed by its unit and claims to produce a more powerful TNT equivalent explosion than any solid explosive that is available right now. The new explosive is reported to be 2.01 times more powerful than a standard TNT (Trinitrotoluene) explosion. The impact of an explosive is measured in terms of TNT equivalence, and any explosive with a higher TNT equivalence has greater destructive power.",
      "date": "2024-07-02",
      "link": "https://www.moneycontrol.com/news/business/solar-industries-record-market-cap-explosive-sebex-12760486.html/amp",
      "showOnHomepage": true,
      "showOnNewspage": true
    },
    {
      "id": 3,
      "thumbnail": "./img/news/5.webp",
      "headline": "Indian Navy Successfully Tests Indigenously Developed Explosives",
      "shortNews": "Solar Industries' SEBEX 2 explosives have revolutionized the Indian Navy's arsenal, surpassing traditional solid explosives in potency and blast effect. This advancement underscores India's progress towards self-reliance in defense, with a focus on enhancing lethality and destructive power in our military capabilities.",
      "date": "2024-06-30",
      "link": "https://timesofindia.indiatimes.com/india/indian-navy-successfully-tests-indigenously-developed-explosives-by-economic-explosives-limited/amp_articleshow/111382128.cms",
      "showOnHomepage": true,
      "showOnNewspage": true
    },
    {
      "id": 4,
      "thumbnail": "./img/news/2.jpg",
      "headline": "The Indian Army has placed a supply order on Economics Explosives Ltd (EEL)",
      "shortNews": "",
      "date": "2024-06-14",
      "link": "#",
      "showOnHomepage": true,
      "showOnNewspage": true
    },
    {
      "id": 5,
      "thumbnail": "./img/news/3.jpg",
      "headline": "Solar Industries Receives Order Worth ₹1,853 Crore From Coal India",
      "shortNews": "Solar Industries has received a bulk explosive order from COal India Limited worth Rs 1,853 crore, the company announced through an exchange filing. The order is to be delivered within the span of two years.",
      "date": "2023-10-07",
      "link": "https://www.freepressjournal.in/business/solar-industries-receives-order-worth-1853-crore-from-coal-india",
      "showOnHomepage": true,
      "showOnNewspage": true
    },
    {
      "id": 6,
      "thumbnail": "./img/news3.jpg",
      "headline": "Solar Industries demonstrates smallest rocket motor to CDS Gen Anil Chauhan",
      "shortNews": "The Chief of Defence Staff (CDS) General Anil Chauhan (Retired), PVSM, UYSM, AVSM, SM, VSM, visited city-based Economic Explosives Ltd. (EEL), a subsidiary of Solar Group of Industries, on Saturday. On the occasion, the CDS was shown test firing of the smallest rocket motor, a state-of-the-art product, under development at the EEL. ",
      "date": "2023-06-11",
      "link": "https://www.thehitavada.com/Encyc/2023/6/11/Solar-Industries-demonstrates-smallest-rocket-motor-to-CDS-Gen-Anil-Chauhan.html",
      "showOnHomepage": true,
      "showOnNewspage": true
    }
  ]
}
